# CME538 Tutorial 12: Introduction to SQL

Content by Katia

# Overview of Notebook

## Tutorial Structure:

1. Introduction to Databases and SQL

2. Writing SQL Queries using Magic SQL (`%%sql`)
- `SELECT`
- `WHERE`
- `LIMIT`
- `ORDER BY`
- `OFFSET`
- `JOIN`/`ON`
- `HAVING`
- Complex Queries

3. SQL Queries to Python, Creating Databases, Python to SQL Connections
- Write a SQL table to Pandas dataframe
- Create a SQL Database
    - Tables from Pandas
    - Tables written in SQL

## References

- SQL Alchemy Documentation: https://docs.sqlalchemy.org/en/20/intro.html
- Introduction to SQL, W3 Schools: https://www.w3schools.com/sql/
- References https://database.guide/2-sample-databases-sqlite/

*Prepared in November 2023*

## What is a database?

A database is an organized collection of structured information, or data, typically stored electronically in a computer system. A database is usually controlled by a database management system (DBMS). Together, the data and the DBMS, along with the applications that are associated with them, are referred to as a database system, often shortened to just database.

Data within the most common types of databases in operation today is typically modeled in rows and columns in a series of tables to make processing and data querying efficient. The data can then be easily accessed, managed, modified, updated, controlled, and organized. Most databases use structured query language (SQL) for writing and querying data.

Common database types include:
- `SQLite`: database engine written in C programming language, self-contained (no extra server requirements), and used for smaller systems. Commonly used in Python SQL applications for this reason!
- `MS Access`: Used for small or in-home business applications. Similar to SQLite.
- `Postresql`: Open source relational database, used for many web, mobile, and geospatial applications.
- `MySQL`: open-source relational database system, comes with a user management interface. Good for more advanced applications, with many users accessing the information.
- `MS SQL`: Microsoft SQL Server. Integrates well with the Office Suite, and higher storage/compute compatability.
- `Oracle DB`: Multi-model database management system, commonly employed when multiple environments for data storage and validation, with common data processing and refreshing.
- `NoSQL`: database approach design that prioritizes retreiving data not in a tabular format (for example, a key-value system like dictionaries, but on a much larger scale).

## What is SQL (Structured Query Language)?

SQL is a programming language used by nearly all relational databases to query, manipulate, and define data, and to provide access control. SQL was first developed at IBM in the 1970s with Oracle as a major contributor, which led to implementation of the SQL ANSI standard, SQL has spurred many extensions from companies such as IBM, Oracle, and Microsoft. Although SQL is still widely used today, new programming languages are beginning to appear.

## SQL vs. Pandas?

SQL natively works better with distributed computing systems, and has fewer key-words than built in (compared to how many Pandas functions there are). SQL directly connects to local and remote database servers, and is meant with handling large volumes of information - SQL is good to batch this data, and performing aggregate functions in memory, in a much cheaper and cost-efficent way compared to Python/Pandas.

Pandas on the other hand is very good for visualization and machine learning tasks.

Almost all the commands that are native to SQL can be replicated in Pandas as well (but as you will see in tutorial, there are a few things simplified from using SQL!).

## What is a relational database? How is this different from what we studied so far?

In contrast to individually saving data files, with SQL we are able to have multiple data sources saved in a computationally efficient way, preserve relationships between them and maintain data integrity.

We will be working with the SQLite database file `chinook.db`. Data source: https://www.sqlitetutorial.net/sqlite-sample-database/

This image shows all the tables in the database (name on top of each box), as well as the columns available (within the box) and keys (i.e. columns) where the joins happen between tables:
![Database Tables](sqllite_tables.jpeg)

### Install packages, do updates

In [1]:
# install the sql package
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (0.5.0)
Requirement already satisfied: sqlparse in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: sqlalchemy>=2.0 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (2.0.23)
Requirement already satisfied: six in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: prettytable in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: ipython-genutils in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: backcall in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pexpect>4.3 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: setuptools>=18.5 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (65.6.3)
Requirement already satisfied: pygments in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: jedi>=0.10 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (0.17.1)
Requirement already satisfied: appnope in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (0.1.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (3.0.8)
Requirement already satisfied: decorator in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: traitlets>=4.2 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: pickleshare in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from jedi>=0.10->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: ptyprocess>=0.5 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.6.0)
Requirement already satisfied: wcwidth in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)
WARNING: You are using pip version 21.1.2; however, version 23.3.1 is available.
You should consider upgrading via the '/Users/ekaterinaossetchkina/opt/anaconda3/bin/python -m pip install --upgrade pip' command.

In [2]:
#alternatively, we can use a tool like sqlalchemy to explicity define the connection
!pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (2.0.23)
Requirement already satisfied: greenlet!=0.4.17 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from SQLAlchemy) (3.0.1)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from SQLAlchemy) (4.8.0)
WARNING: You are using pip version 21.1.2; however, version 23.3.1 is available.
You should consider upgrading via the '/Users/ekaterinaossetchkina/opt/anaconda3/bin/python -m pip install --upgrade pip' command.

In [4]:
# note: sometimes an older version of Pandas can throw errors
!pip install --upgrade pandas

Requirement already satisfied: pandas in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (2.0.3)
Requirement already satisfied: pytz>=2020.1 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.20.3 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.24.0)
Requirement already satisfied: tzdata>=2022.1 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2023.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.8.2->pandas) (1.15.0)
WARNING: You are using pip version 21.1.2; however, version 23.3.1 is available.
You should consider upgrading via the '/Users/ekaterinaossetchkina/opt/anaconda3/bin/python -m pip install --upgrade pip' command.

In [5]:
# define imports

# main library we will be using is sqlite3
import sqlite3
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# alternative library to work with SQL directly in Pandas
import sqlalchemy

# Configure Notebook
%matplotlib inline
plt.style.use('fivethirtyeight')
sns.set_context("notebook")

/Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages/pandas/core/computation/expressions.py:20: UserWarning: Pandas requires version '2.7.3' or newer of 'numexpr' (version '2.7.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

In [7]:
# ipython magic command - load the SQL extension.
# Needs to be done for sqlite!
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

If you already loaded SQL during your kernel run, you would use `%reload_ext sql`

### Writing SQL in Python

`%%sql%%` is a magic Python commond (iPython) that will allow you to write and execute SQL code in a Jupyter notebook cell. One side note, the entire cell will be treated as SQL code when you write this command, including comments!

First, we want to load the data, we do this by calling `sqlite:///` and then giving the path of the `.db` file relative to the notebook (for example `sqlite:///chinook.db`), or by directly providing a server connection string here (`postgresql://postgres:password123@localhost/dvdrental`).

In [11]:
%%sql
sqlite:///chinook.db

**Important Note:** In magic SQL, the database connections will remain open until you restart your kernel! Can explicitly close connections to, which we will show later in the tutorial.

Great! Now that we are connected, we can start running queries. What tables do we have in `chinook.db`? One side note, comments are delineated by `--` in SQL. (in some versions of SQL, `\\` also works, but `--` is pretty universal)

In [12]:
%%sql
select * from sqlite_master where type='table' --this is a comment

 * sqlite:///chinook.db
Done.

[('table', 'albums', 'albums', 2, 'CREATE TABLE "albums"\r\n(\r\n    [AlbumId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Title] NVARCHAR(160)  NOT NULL,\r\n    [ArtistId] INTEGER  NOT NULL,\r\n    FOREIGN KEY ([ArtistId]) REFERENCES "artists" ([ArtistId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'artists', 'artists', 4, 'CREATE TABLE "artists"\r\n(\r\n    [ArtistId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'customers', 'customers', 5, 'CREATE TABLE "customers"\r\n(\r\n    [CustomerId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [FirstName] NVARCHAR(40)  NOT NULL,\r\n    [Last ... (317 characters truncated) ... SupportRepId] INTEGER,\r\n    FOREIGN KEY ([SupportRepId]) REFERENCES "employees" ([EmployeeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'employees', 'employees', 8, 'CREATE TABLE "employees"\r\n(\r\n    [EmployeeId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [LastName] NVARCHAR(20)  NOT NULL,\r\n    [First ... (356 characters truncated) ...     [Email] NVARCHAR(60),\r\n    FOREIGN KEY ([ReportsTo]) REFERENCES "employees" ([EmployeeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'genres', 'genres', 10, 'CREATE TABLE "genres"\r\n(\r\n    [GenreId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'invoices', 'invoices', 11, 'CREATE TABLE "invoices"\r\n(\r\n    [InvoiceId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [CustomerId] INTEGER  NOT NULL,\r\n    [InvoiceDat ... (226 characters truncated) ... NUMERIC(10,2)  NOT NULL,\r\n    FOREIGN KEY ([CustomerId]) REFERENCES "customers" ([CustomerId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'invoice_items', 'invoice_items', 13, 'CREATE TABLE "invoice_items"\r\n(\r\n    [InvoiceLineId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [InvoiceId] INTEGER  NOT NULL,\r\n    [Tr ... (191 characters truncated) ... TE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([TrackId]) REFERENCES "tracks" ([TrackId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'media_types', 'media_types', 15, 'CREATE TABLE "media_types"\r\n(\r\n    [MediaTypeId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'playlists', 'playlists', 16, 'CREATE TABLE "playlists"\r\n(\r\n    [PlaylistId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'),
 ('table', 'playlist_track', 'playlist_track', 17, 'CREATE TABLE "playlist_track"\r\n(\r\n    [PlaylistId] INTEGER  NOT NULL,\r\n    [TrackId] INTEGER  NOT NULL,\r\n    CONSTRAINT [PK_PlaylistTrack] PR ... (125 characters truncated) ... TE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([TrackId]) REFERENCES "tracks" ([TrackId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'tracks', 'tracks', 20, 'CREATE TABLE "tracks"\r\n(\r\n    [TrackId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(200)  NOT NULL,\r\n    [AlbumId] INTEG ... (415 characters truncated) ... ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([MediaTypeId]) REFERENCES "media_types" ([MediaTypeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'),
 ('table', 'sqlite_stat1', 'sqlite_stat1', 864, 'CREATE TABLE sqlite_stat1(tbl,idx,stat)'),
 ('table', 'summary', 'summary', 865, 'CREATE TABLE summary (\n\t"index" BIGINT, \n\tname TEXT, \n\tgenres TEXT, \n\tage TEXT\n)'),
 ('table', 'summary_df', 'summary_df', 871, 'CREATE TABLE summary_df (\n\t"index" BIGINT, \n\tname TEXT, \n\tgenres TEXT, \n\tage TEXT\n)'),
 ('table', 'summary_df_test', 'summary_df_test', 876, 'CREATE TABLE summary_df_test (\n\t"index" BIGINT, \n\tname TEXT, \n\tgenres TEXT, \n\tage TEXT\n)')]

Let's explain this table - the `tbl_name` has the names of the different tables, and the `sql` column directly shows us the SQL code that was used to construct the table. In the `sql` column, we can see the different column names, as well as the variable types that are allowed within the columns.

Let's write our first SQL query, using the `SELECT` keyword (which will bring us back a view-only form of the table). In SQL, we always specify the column names (which is what `SELECT` will apply too and the table name

*Syntax*: `SELECT` **columns** `FROM` **table** `;` 

When we want to select **all** the columns in a table, we use the `*` symbol. For instance, say we wanted to select all the columns from the table `media_types`:

In [13]:
%%sql
select * from media_types;

 * sqlite:///chinook.db
Done.

[(1, 'MPEG audio file'),
 (2, 'Protected AAC audio file'),
 (3, 'Protected MPEG-4 video file'),
 (4, 'Purchased AAC audio file'),
 (5, 'AAC audio file')]

Another common practice is to indent the code and start new parts of the SQL command on new lines, as well as capitalize the key SQL commands (in this case, `SELECT` and `FROM` - case sensitivity is not an issue in SQL!). This is to improve the readibility of the query (as they can get quite complicated and long!). Below is our same code reformatted:

In [14]:
%%sql
SELECT *
FROM media_types; --same code, but easier to read

 * sqlite:///chinook.db
Done.

[(1, 'MPEG audio file'),
 (2, 'Protected AAC audio file'),
 (3, 'Protected MPEG-4 video file'),
 (4, 'Purchased AAC audio file'),
 (5, 'AAC audio file')]

One note: by default the SQL query will bring back the whole table, so we use the `LIMIT` to bring back only the first selected numbers of rows (equivalent to `df.head()` from Pandas!):

In [18]:
%%sql
SELECT *
FROM Customers
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4),
 (6, 'Helena', 'Holý', None, 'Rilská 3174/6', 'Prague', None, 'Czech Republic', '14300', '+420 2 4177 0449', None, 'hholy@gmail.com', 5),
 (7, 'Astrid', 'Gruber', None, 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', '+43 01 5134505', None, 'astrid.gruber@apple.at', 5),
 (8, 'Daan', 'Peeters', None, 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', '+32 02 219 03 03', None, 'daan_peeters@apple.be', 4),
 (9, 'Kara', 'Nielsen', None, 'Sønder Boulevard 51', 'Copenhagen', None, 'Denmark', '1720', '+453 3331 9991', None, 'kara.nielsen@jubii.dk', 4),
 (10, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4)]

## Common Expressions and Operations in SQL

If we wanted to just bring back the columns `Address`, `City` and `State` columns, our query would change like so:

In [19]:
%%sql
SELECT Address, City, State
FROM Customers
LIMIT 10;

 * sqlite:///chinook.db
Done.

[('Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP'),
 ('Theodor-Heuss-Straße 34', 'Stuttgart', None),
 ('1498 rue Bélanger', 'Montréal', 'QC'),
 ('Ullevålsveien 14', 'Oslo', None),
 ('Klanova 9/506', 'Prague', None),
 ('Rilská 3174/6', 'Prague', None),
 ('Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None),
 ('Grétrystraat 63', 'Brussels', None),
 ('Sønder Boulevard 51', 'Copenhagen', None),
 ('Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP')]

As well, we can also `ORDER BY` a particular column. If we wanted to do the equivalent in pandas, our command would look something like this (and **case-sensitivity** would also be important in Python for column/table names, notice that this is not important in SQL):

`df = df[[Address, City]].sort_values(by=['City'])`

`df.head()`

In [20]:
%%sql
SELECT address, city
FROM customers
ORDER BY city
LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Lijnbaansgracht 120bg', 'Amsterdam'),
 ('3,Raj Bhavan Road', 'Bangalore'),
 ('Tauentzienstraße 8', 'Berlin'),
 ('Barbarossastraße 19', 'Berlin'),
 ('9, Place Louis Barthou', 'Bordeaux')]

A row-level filter we can apply is the `WHERE` key-word, applied after the table is selected using the `FROM` key-word. Mnemonically, this is much simpler to remember compared to pandas filtering functions. The ordering in SQL also guarantees less anomalous behaviour, while also being computationally efficient.

In [21]:
%%sql
SELECT address, city
FROM customers
WHERE city == 'Berlin';

 * sqlite:///chinook.db
Done.

[('Tauentzienstraße 8', 'Berlin'), ('Barbarossastraße 19', 'Berlin')]

Let's look at the `Invoices` table now:

In [22]:
%%sql
SELECT *
FROM invoices
LIMIT 7;

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98)]

It is important to note the different data types in SQL:
- `INT`: same as in Python
- `REAL`: equivalent to float in Python
- `TEXT`: umbrella for nvarchar, usually has limitation on length (for example, nvarchar48 can be a string of up to 48 characters).
- `BLOB`: Binary Large Objects, can be any type of file (mp3 files, pdfs, other database tables) or any type of data entry.
- `DATETIME`: same as Python

It is important to be mindful of the data-type when exeucuting the `WHERE` condition. Let's do a numerical `WHERE` condition instead:

In [23]:
%%sql
SELECT invoiceId, total
FROM invoices
WHERE total > 1.5
LIMIT 7;

 * sqlite:///chinook.db
Done.

[(1, 1.98), (2, 3.96), (3, 5.94), (4, 8.91), (5, 13.86), (7, 1.98), (8, 1.98)]

If we treated the `Total` column like a string instead, the string query would still execute, notice the following:

In [24]:
%%sql
SELECT invoiceId, total
FROM invoices
WHERE total == 1.98
LIMIT 7;

 * sqlite:///chinook.db
Done.

[(1, 1.98),
 (7, 1.98),
 (8, 1.98),
 (14, 1.98),
 (15, 1.98),
 (21, 1.98),
 (22, 1.98)]

In [25]:
%%sql
SELECT invoiceId, total
FROM invoices
WHERE total == '1.98'
LIMIT 7;

 * sqlite:///chinook.db
Done.

[(1, 1.98),
 (7, 1.98),
 (8, 1.98),
 (14, 1.98),
 (15, 1.98),
 (21, 1.98),
 (22, 1.98)]

You can also have more than one filter condition available! Notice that the filtering below is occuring on different columns (`total` and `BillingCity`) than those returned in the table (`invoiceId` and `total`). If we tried to do something like this in pandas, our query would look like so:

`df_filtered = df.loc[(df['total'] > 1.5) | (df['BillingState'] == 'AB'),['invoiceId','total','CustomerId']]`

while you get the same result, in the SQL query it is a bit easier to understand the operations and the way the queried results will be returned.

In [27]:
%%sql
SELECT invoiceId, total, CustomerID
FROM Invoices
WHERE total > 1.5 OR BillingState == 'AB'
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 1.98, 2),
 (2, 3.96, 4),
 (3, 5.94, 8),
 (4, 8.91, 14),
 (5, 13.86, 23),
 (7, 1.98, 38),
 (8, 1.98, 40),
 (9, 3.96, 42),
 (10, 5.94, 46),
 (11, 8.91, 52)]

Let's sort these results using the `ORDER BY` keyword that we learned earlier, we can also add additional arguments - ascending `ASC` or descending `DESC`:

In [28]:
%%sql
SELECT invoiceId, total, CustomerID
FROM Invoices
WHERE total > 1.5 OR BillingState == 'AB'
ORDER BY total DESC
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(404, 25.86, 6),
 (299, 23.86, 26),
 (96, 21.86, 45),
 (194, 21.86, 46),
 (89, 18.86, 7),
 (201, 18.86, 25),
 (88, 17.91, 57),
 (306, 16.86, 5),
 (313, 16.86, 43),
 (103, 15.86, 24)]

Note that there is no equivalent to the Pandas `.tail()`, but we can use a combination of `ORDER BY` and `LIMIT` keywords to acheive the same result:

In [30]:
%%sql
SELECT *
FROM genres
ORDER BY name DESC
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(16, 'World'),
 (19, 'TV Shows'),
 (10, 'Soundtrack'),
 (18, 'Science Fiction'),
 (20, 'Sci Fi & Fantasy')]

Let's say you wanted to omit the first (or last) few results when you presented your ordered dataframe. You can use the `OFFSET` command to skip over a few entries:

In [31]:
%%sql
SELECT *
FROM genres
ORDER BY name DESC
LIMIT 5
OFFSET 1;

 * sqlite:///chinook.db
Done.

[(19, 'TV Shows'),
 (10, 'Soundtrack'),
 (18, 'Science Fiction'),
 (20, 'Sci Fi & Fantasy'),
 (5, 'Rock And Roll')]

Especially when working with a given dataset, you might have long column or table names! To simplify creating SQL queries, you can renaming entities with the `AS` keyword, when the object is first called/defined. In this example:
- the `invoices` table becomes `i`
- the columns are renamed:
    - `invoiceId` as `inv`
    - `total` as `tot`
    - `CustomerId` as `cust`

In [32]:
%%sql
SELECT invoiceId AS inv,
        total as tot,
        CustomerId as cust
FROM invoices as i
WHERE tot > 1.5 OR BillingState == 'AB'
ORDER BY tot ASC
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(230, 0.99, 14),
 (1, 1.98, 2),
 (7, 1.98, 38),
 (8, 1.98, 40),
 (14, 1.98, 17),
 (15, 1.98, 19),
 (21, 1.98, 55),
 (22, 1.98, 57),
 (28, 1.98, 34),
 (29, 1.98, 36)]

To convert a data-type, the `CAST` SQL command is used, with the `AS` keyword also applied to specify the desired data-type. It can be a good practice to introduce casting when joining tables if not sure that they share the same data-type, or importing data from a source like a csv (that traditionally keeps data-types as strings):

In [33]:
%%sql
SELECT *
FROM invoices 
LIMIT 7;

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98)]

In [34]:
%%sql
SELECT total, CAST(Total AS int), InvoiceDate, CAST(InvoiceDate AS int) AS InvoiceYear
FROM Invoices
LIMIT 7;

 * sqlite:///chinook.db
Done.

[(1.98, 1, '2009-01-01 00:00:00', 2009),
 (3.96, 3, '2009-01-02 00:00:00', 2009),
 (5.94, 5, '2009-01-03 00:00:00', 2009),
 (8.91, 8, '2009-01-06 00:00:00', 2009),
 (13.86, 13, '2009-01-11 00:00:00', 2009),
 (0.99, 0, '2009-01-19 00:00:00', 2009),
 (1.98, 1, '2009-02-01 00:00:00', 2009)]

What is we wanted to get customers only, or perform an aggregation to get some statistics? Similar to pandas, we can use the `GROUP BY` key-words to help us out here.

First, let's use both `SELECT` and `GROUP BY` to see all the `CustomerId` entries:

In [35]:
%%sql
SELECT CustomerId As Customer
FROM invoices
GROUP BY Customer
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,)]

When we `SELECT` all the columns, the default value returned from the `GROUP BY` for a column will be the top "rolled up" result (i.e. the latest entry that has that specified group value):

In [36]:
%%sql
SELECT *
FROM invoices
GROUP BY CustomerId;

 * sqlite:///chinook.db
Done.

[(98, 1, '2010-03-11 00:00:00', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', 3.98),
 (1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (99, 3, '2010-03-11 00:00:00', '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', 3.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (77, 5, '2009-12-08 00:00:00', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', 1.98),
 (46, 6, '2009-07-11 00:00:00', 'Rilská 3174/6', 'Prague', None, 'Czech Republic', '14300', 8.91),
 (78, 7, '2009-12-08 00:00:00', 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', 1.98),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (56, 9, '2009-09-06 00:00:00', 'Sønder Boulevard 51', 'Copenhagen', None, 'Denmark', '1720', 1.98),
 (25, 10, '2009-04-09 00:00:00', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', 8.91),
 (57, 11, '2009-09-06 00:00:00', 'Av. Paulista, 2022', 'São Paulo', 'SP', 'Brazil', '01310-200', 1.98),
 (34, 12, '2009-05-23 00:00:00', 'Praça Pio X, 119', 'Rio de Janeiro', 'RJ', 'Brazil', '20040-020', 0.99),
 (35, 13, '2009-06-05 00:00:00', 'Qe 7 Bloco G', 'Brasília', 'DF', 'Brazil', '71020-677', 1.98),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (36, 15, '2009-06-05 00:00:00', '700 W Pender Street', 'Vancouver', 'BC', 'Canada', 'V6C 1G8', 1.98),
 (13, 16, '2009-02-19 00:00:00', '1600 Amphitheatre Parkway', 'Mountain View', 'CA', 'USA', '94043-1351', 0.99),
 (14, 17, '2009-03-04 00:00:00', '1 Microsoft Way', 'Redmond', 'WA', 'USA', '98052-8300', 1.98),
 (112, 18, '2010-05-12 00:00:00', '627 Broadway', 'New York', 'NY', 'USA', '10012-2612', 1.98),
 (15, 19, '2009-03-04 00:00:00', '1 Infinite Loop', 'Cupertino', 'CA', 'USA', '95014', 1.98),
 (113, 20, '2010-05-12 00:00:00', '541 Del Medio Avenue', 'Mountain View', 'CA', 'USA', '94040-111', 1.98),
 (16, 21, '2009-03-05 00:00:00', '801 W 4th Street', 'Reno', 'NV', 'USA', '89503', 3.96),
 (91, 22, '2010-02-08 00:00:00', '120 S Orange Ave', 'Orlando', 'FL', 'USA', '32801', 1.98),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (92, 24, '2010-02-08 00:00:00', '162 E Superior Street', 'Chicago', 'IL', 'USA', '60611', 1.98),
 (17, 25, '2009-03-06 00:00:00', '319 N. Frances Street', 'Madison', 'WI', 'USA', '53703', 5.94),
 (70, 26, '2009-11-07 00:00:00', '2211 W Berry Street', 'Fort Worth', 'TX', 'USA', '76110', 1.98),
 (39, 27, '2009-06-10 00:00:00', '1033 N Park Ave', 'Tucson', 'AZ', 'USA', '85719', 8.91),
 (71, 28, '2009-11-07 00:00:00', '302 S 700 E', 'Salt Lake City', 'UT', 'USA', '84102', 1.98),
 (48, 29, '2009-07-24 00:00:00', '796 Dundas Street West', 'Toronto', 'ON', 'Canada', 'M6J 1V1', 0.99),
 (49, 30, '2009-08-06 00:00:00', '230 Elgin Street', 'Ottawa', 'ON', 'Canada', 'K2P 1L7', 1.98),
 (18, 31, '2009-03-09 00:00:00', '194A Chain Lake Drive', 'Halifax', 'NS', 'Canada', 'B3S 1C5', 8.91),
 (50, 32, '2009-08-06 00:00:00', '696 Osborne Street', 'Winnipeg', 'MB', 'Canada', 'R3L 2B9', 1.98),
 (27, 33, '2009-04-22 00:00:00', '5112 48 Street', 'Yellowknife', 'NT', 'Canada', 'X1A 1N6', 0.99),
 (28, 34, '2009-05-05 00:00:00', 'Rua da Assunção 53', 'Lisbon', None, 'Portugal', None, 1.98),
 (126, 35, '2010-07-13 00:00:00', 'Rua dos Campeões Europeus de Viena, 4350', 'Porto', None, 'Portugal', None, 1.98),
 (29, 36, '2009-05-05 00:00:00', 'Tauentzienstraße 8', 'Berlin', None, 'Germany', '10789', 1.98),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (105, 39, '2010-04-11 00:00:00', '4, Rue Milton', 'Paris', None, 'France', '75009', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (106, 41, '2010-04-11 00:00:00', '11, Place Bellecour', 'Lyon', None, 'France', '69002', 1.98),
 (9, 42, '2009-02-02 00:00:00', '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', 3.96),
 (84, 43, '2010-01-08 00:00:00', '68, Rue Jouvence', 'Dijon', None, 'France', '21000', 1.98),
 (53, 44, '2009-08-11 00:00:00', 'Porthaninkatu 9', 'Helsinki', None, 'Finland', '00530', 8.91),
 (85, 45, '2010-01-08 00:00:00', 'Erzsébet krt. 58.', 'Budapest', None, 'Hungary', 'H-1073', 1.98),
 (10, 46, '2009-02-03 00:00:00', '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, 5.94),
 (63, 47, '2009-10-07 00:00:00', 'Via Degli Scipioni, 43', 'Rome', 'RM', 'Italy', '00192', 1.98),
 (32, 48, '2009-05-10 00:00:00', 'Lijnbaansgracht 120bg', 'Amsterdam', 'VV', 'Netherlands', '1016', 8.91),
 (64, 49, '2009-10-07 00:00:00', 'Ordynacka 10', 'Warsaw', None, 'Poland', '00-358', 1.98),
 (41, 50, '2009-06-23 00:00:00', 'C/ San Bernardo 85', 'Madrid', None, 'Spain', '28015', 0.99),
 (42, 51, '2009-07-06 00:00:00', 'Celsiusg. 9', 'Stockholm', None, 'Sweden', '11230', 1.98),
 (11, 52, '2009-02-06 00:00:00', '202 Hoxton Street', 'London', None, 'United Kingdom', 'N1 5LH', 8.91),
 (43, 53, '2009-07-06 00:00:00', '113 Lupus St', 'London', None, 'United Kingdom', 'SW1V 3EN', 1.98),
 (20, 54, '2009-03-22 00:00:00', '110 Raeburn Pl', 'Edinburgh ', None, 'United Kingdom', 'EH4 1HH', 0.99),
 (21, 55, '2009-04-04 00:00:00', '421 Bourke Street', 'Sidney', 'NSW', 'Australia', '2010', 1.98),
 (119, 56, '2010-06-12 00:00:00', '307 Macacha Güemes', 'Buenos Aires', None, 'Argentina', '1106', 1.98),
 (22, 57, '2009-04-04 00:00:00', 'Calle Lira, 198', 'Santiago', None, 'Chile', None, 1.98),
 (120, 58, '2010-06-12 00:00:00', '12,Community Centre', 'Delhi', None, 'India', '110017', 1.98),
 (23, 59, '2009-04-05 00:00:00', '3,Raj Bhavan Road', 'Bangalore', None, 'India', '560001', 3.96)]

We can have multiple advanced aggregation optionms, like so (and we can always rename using `AS` same as before, to layer our queries):

In [38]:
%%sql
SELECT CustomerId, min(BillingCountry), InvoiceDate, min(InvoiceDate) AS MIN_DATE, max(InvoiceDate)
AS MAX_DATE, total, AVG(total), SUM(total), MAX(total), MIN(total)
FROM invoices
GROUP BY CustomerId
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'Brazil', '2011-05-06 00:00:00', '2010-03-11 00:00:00', '2013-08-07 00:00:00', 0.99, 5.659999999999999, 39.62, 13.86, 0.99),
 (2, 'Germany', '2012-07-13 00:00:00', '2009-01-01 00:00:00', '2012-07-13 00:00:00', 0.99, 5.3742857142857146, 37.620000000000005, 13.86, 0.99),
 (3, 'Canada', '2013-09-20 00:00:00', '2010-03-11 00:00:00', '2013-09-20 00:00:00', 0.99, 5.659999999999999, 39.62, 13.86, 0.99),
 (4, 'Norway', '2009-11-25 00:00:00', '2009-01-02 00:00:00', '2013-10-03 00:00:00', 0.99, 5.659999999999999, 39.62, 15.86, 0.99),
 (5, 'Czech Republic', '2011-02-02 00:00:00', '2009-12-08 00:00:00', '2013-05-06 00:00:00', 0.99, 5.802857142857143, 40.620000000000005, 16.86, 0.99),
 (6, 'Czech Republic', '2012-04-11 00:00:00', '2009-07-11 00:00:00', '2013-11-13 00:00:00', 0.99, 7.088571428571429, 49.620000000000005, 25.86, 0.99),
 (7, 'Austria', '2013-06-19 00:00:00', '2009-12-08 00:00:00', '2013-06-19 00:00:00', 0.99, 6.088571428571428, 42.62, 18.86, 0.99),
 (8, 'Belgium', '2009-08-24 00:00:00', '2009-01-03 00:00:00', '2013-10-04 00:00:00', 0.99, 5.374285714285714, 37.62, 13.86, 0.99),
 (9, 'Denmark', '2010-11-01 00:00:00', '2009-09-06 00:00:00', '2013-02-02 00:00:00', 0.99, 5.3742857142857146, 37.620000000000005, 13.86, 0.99),
 (10, 'Brazil', '2012-01-09 00:00:00', '2009-04-09 00:00:00', '2013-08-12 00:00:00', 0.99, 5.3742857142857146, 37.620000000000005, 13.86, 0.99)]

No simple equivalent for something like this in Pandas! Additionally, multiple columns can be grouped by, and an aggregation can be specified too:

In [39]:
%%sql
SELECT CustomerId, min(BillingCountry), InvoiceDate, min(InvoiceDate) AS MIN_DATE, max(InvoiceDate)
AS MAX_DATE, total, AVG(total), SUM(total), MAX(total), MIN(total)
FROM invoices
GROUP BY CustomerId, BillingCountry
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'Brazil', '2011-05-06 00:00:00', '2010-03-11 00:00:00', '2013-08-07 00:00:00', 0.99, 5.659999999999999, 39.62, 13.86, 0.99),
 (2, 'Germany', '2012-07-13 00:00:00', '2009-01-01 00:00:00', '2012-07-13 00:00:00', 0.99, 5.3742857142857146, 37.620000000000005, 13.86, 0.99),
 (3, 'Canada', '2013-09-20 00:00:00', '2010-03-11 00:00:00', '2013-09-20 00:00:00', 0.99, 5.659999999999999, 39.62, 13.86, 0.99),
 (4, 'Norway', '2009-11-25 00:00:00', '2009-01-02 00:00:00', '2013-10-03 00:00:00', 0.99, 5.659999999999999, 39.62, 15.86, 0.99),
 (5, 'Czech Republic', '2011-02-02 00:00:00', '2009-12-08 00:00:00', '2013-05-06 00:00:00', 0.99, 5.802857142857143, 40.620000000000005, 16.86, 0.99),
 (6, 'Czech Republic', '2012-04-11 00:00:00', '2009-07-11 00:00:00', '2013-11-13 00:00:00', 0.99, 7.088571428571429, 49.620000000000005, 25.86, 0.99),
 (7, 'Austria', '2013-06-19 00:00:00', '2009-12-08 00:00:00', '2013-06-19 00:00:00', 0.99, 6.088571428571428, 42.62, 18.86, 0.99),
 (8, 'Belgium', '2009-08-24 00:00:00', '2009-01-03 00:00:00', '2013-10-04 00:00:00', 0.99, 5.374285714285714, 37.62, 13.86, 0.99),
 (9, 'Denmark', '2010-11-01 00:00:00', '2009-09-06 00:00:00', '2013-02-02 00:00:00', 0.99, 5.3742857142857146, 37.620000000000005, 13.86, 0.99),
 (10, 'Brazil', '2012-01-09 00:00:00', '2009-04-09 00:00:00', '2013-08-12 00:00:00', 0.99, 5.3742857142857146, 37.620000000000005, 13.86, 0.99)]

Another useful aggregation we can include is `COUNT` - there are a few ways that we can use this:
- Number of records in a table or for a specific condition
- Aggregated count (equivalent to use `.len()` functions in Python)

In [42]:
%%sql
SELECT COUNT(*)
FROM invoices;

 * sqlite:///chinook.db
Done.

[(412,)]

In [43]:
%%sql
SELECT COUNT(*)
FROM invoices
WHERE BillingCountry == 'Canada';

 * sqlite:///chinook.db
Done.

[(56,)]

In [44]:
%%sql
SELECT BillingCountry, COUNT(*)
FROM invoices
GROUP BY BillingCountry
ORDER BY COUNT(*) DESC
LIMIT 6;

 * sqlite:///chinook.db
Done.

[('USA', 91),
 ('Canada', 56),
 ('France', 35),
 ('Brazil', 35),
 ('Germany', 28),
 ('United Kingdom', 21)]

Two other common aggregate functions in addition to `COUNT`, are `SUM` and `AVG` (just be careful of using numeric data-types, otherwise might get an error or unexpected results):

In [45]:
%%sql
SELECT COUNT(*), SUM(total), CAST(SUM(total) AS INT) AS INT_TOTAL, AVG(total)
FROM invoices
WHERE BillingCountry == 'Canada';

 * sqlite:///chinook.db
Done.

[(56, 303.9599999999999, 303, 5.427857142857142)]

In [46]:
%%sql
SELECT BillingCountry, SUM(*)
FROM invoices
WHERE BillingCountry == 'Canada';

 * sqlite:///chinook.db
(sqlite3.OperationalError) wrong number of arguments to function SUM()
[SQL: SELECT BillingCountry, SUM(*)
FROM invoices
WHERE BillingCountry == 'Canada';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

You can also do a `GROUPBY` by multiple columns:

In [47]:
%%sql
SELECT CustomerId, BillingCountry, InvoiceDate, Count(*)
FROM invoices
GROUP BY BillingCountry, InvoiceDate
ORDER BY BillingCountry
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(56, 'Argentina', '2010-06-12 00:00:00', 1),
 (56, 'Argentina', '2010-09-14 00:00:00', 1),
 (56, 'Argentina', '2010-12-17 00:00:00', 1),
 (56, 'Argentina', '2011-08-07 00:00:00', 1),
 (56, 'Argentina', '2013-01-28 00:00:00', 1)]

In [49]:
%%sql
SELECT CustomerId, BillingCountry, MAX(InvoiceDate) as LatestDate, Count(*) as Number,
sum(total) AS SUM, max(total) AS MAX, min(total) AS MIN
FROM invoices
GROUP BY CustomerId, BillingCountry
ORDER BY sum(total) DESC
LIMIT 5;

 * sqlite:///chinook.db
Done.

[(6, 'Czech Republic', '2013-11-13 00:00:00', 7, 49.620000000000005, 25.86, 0.99),
 (26, 'USA', '2013-04-05 00:00:00', 7, 47.620000000000005, 23.86, 0.99),
 (57, 'Chile', '2012-10-14 00:00:00', 7, 46.62, 17.91, 0.99),
 (45, 'Hungary', '2013-07-20 00:00:00', 7, 45.62, 21.86, 0.99),
 (46, 'Ireland', '2013-11-04 00:00:00', 7, 45.62, 21.86, 0.99)]

You may have noticed that SQL operators follow a specifc order in a query. When we do a `GROUP BY`, an important observation is that `WHERE` can no longer be applied to for filtering.

Instead, we need to rely on a new key-word, `HAVING`, which will do this row-based filtering on the groups (this would be similar to writing something like `.groupby("type").filter(lambda f: max(f["cost"]) < 8)` in Pandas).

To summarize, for **rows we use `WHERE`, for groups we use `HAVING`**.

<img src="order_operations.png" width="300">

In [50]:
%%sql
SELECT *
FROM invoices
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94),
 (4, 14, '2009-01-06 00:00:00', '8210 111 ST NW', 'Edmonton', 'AB', 'Canada', 'T6G 2C7', 8.91),
 (5, 23, '2009-01-11 00:00:00', '69 Salem Street', 'Boston', 'MA', 'USA', '2113', 13.86),
 (6, 37, '2009-01-19 00:00:00', 'Berger Straße 10', 'Frankfurt', None, 'Germany', '60316', 0.99),
 (7, 38, '2009-02-01 00:00:00', 'Barbarossastraße 19', 'Berlin', None, 'Germany', '10779', 1.98),
 (8, 40, '2009-02-01 00:00:00', '8, Rue Hanovre', 'Paris', None, 'France', '75002', 1.98),
 (9, 42, '2009-02-02 00:00:00', '9, Place Louis Barthou', 'Bordeaux', None, 'France', '33000', 3.96),
 (10, 46, '2009-02-03 00:00:00', '3 Chatham Street', 'Dublin', 'Dublin', 'Ireland', None, 5.94)]

In [54]:
%%sql
SELECT CustomerId, BillingCountry, MAX(InvoiceDate), total
FROM invoices
GROUP BY BillingCountry
HAVING MAX(total) > 15
ORDER BY total DESC
LIMIT 15;

 * sqlite:///chinook.db
Done.

[(6, 'Czech Republic', '2013-11-13 00:00:00', 25.86),
 (26, 'USA', '2013-12-05 00:00:00', 23.86),
 (46, 'Ireland', '2013-11-04 00:00:00', 21.86),
 (45, 'Hungary', '2013-07-20 00:00:00', 21.86),
 (7, 'Austria', '2013-06-19 00:00:00', 18.86),
 (57, 'Chile', '2012-10-14 00:00:00', 17.91),
 (43, 'France', '2013-11-03 00:00:00', 16.86),
 (4, 'Norway', '2013-10-03 00:00:00', 15.86)]

If we want to return distinct results over specific columns, we can `DISTINCT` keyword:

In [55]:
%%sql
SELECT *
FROM customers
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4),
 (6, 'Helena', 'Holý', None, 'Rilská 3174/6', 'Prague', None, 'Czech Republic', '14300', '+420 2 4177 0449', None, 'hholy@gmail.com', 5),
 (7, 'Astrid', 'Gruber', None, 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', '+43 01 5134505', None, 'astrid.gruber@apple.at', 5),
 (8, 'Daan', 'Peeters', None, 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', '+32 02 219 03 03', None, 'daan_peeters@apple.be', 4),
 (9, 'Kara', 'Nielsen', None, 'Sønder Boulevard 51', 'Copenhagen', None, 'Denmark', '1720', '+453 3331 9991', None, 'kara.nielsen@jubii.dk', 4),
 (10, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4)]

Here is the difference from adding the `DISTINCT` keyword:

In [58]:
%%sql
SELECT Country
FROM customers
ORDER BY Country DESC
LIMIT 15;

 * sqlite:///chinook.db
Done.

[('United Kingdom',),
 ('United Kingdom',),
 ('United Kingdom',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',),
 ('USA',)]

In [59]:
%%sql
SELECT COUNT(Country)
FROM Customers;

 * sqlite:///chinook.db
Done.

[(59,)]

In [60]:
%%sql
SELECT COUNT(DISTINCT Country)
FROM Customers;

 * sqlite:///chinook.db
Done.

[(24,)]

In [61]:
%%sql
SELECT DISTINCT Country
FROM customers
ORDER BY Country DESC
LIMIT 15;

 * sqlite:///chinook.db
Done.

[('United Kingdom',),
 ('USA',),
 ('Sweden',),
 ('Spain',),
 ('Portugal',),
 ('Poland',),
 ('Norway',),
 ('Netherlands',),
 ('Italy',),
 ('Ireland',),
 ('India',),
 ('Hungary',),
 ('Germany',),
 ('France',),
 ('Finland',)]

In [62]:
%%sql
SELECT DISTINCT CustomerId, BillingCountry, MAX(InvoiceDate), total
FROM invoices
GROUP BY BillingCountry
HAVING MAX(total) > 15
ORDER BY total DESC
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(6, 'Czech Republic', '2013-11-13 00:00:00', 25.86),
 (26, 'USA', '2013-12-05 00:00:00', 23.86),
 (46, 'Ireland', '2013-11-04 00:00:00', 21.86),
 (45, 'Hungary', '2013-07-20 00:00:00', 21.86),
 (7, 'Austria', '2013-06-19 00:00:00', 18.86),
 (57, 'Chile', '2012-10-14 00:00:00', 17.91),
 (43, 'France', '2013-11-03 00:00:00', 16.86),
 (4, 'Norway', '2013-10-03 00:00:00', 15.86)]

A `JOIN` clause is used to combine rows from two or more tables, based on a related column between them, with the additional `ON` keyword. Let's combine two tables based on the figure below, `tracks` and `media_types`.

![Database Tables](sqllite_tables.jpeg)

But first, let's comment on the different types of joins available in SQL. The syntax will look different in the query, but the terminology is the same as what we've used in `pd.merge`:
- `(INNER) JOIN`: Returns records that have matching values in both tables
- `LEFT (OUTER) JOIN`: Returns all records from the left table, and the matched records from the right table
- `RIGHT (OUTER) JOIN`: Returns all records from the right table, and the matched records from the left table
- `FULL (OUTER) JOIN`: Returns all records when there is a match in either left or right table

![Join Types](join_types.png)

In [63]:
%%sql
SELECT *
FROM media_types;

 * sqlite:///chinook.db
Done.

[(1, 'MPEG audio file'),
 (2, 'Protected AAC audio file'),
 (3, 'Protected MPEG-4 video file'),
 (4, 'Purchased AAC audio file'),
 (5, 'AAC audio file')]

In [64]:
%%sql 
SELECT *
FROM tracks
LIMIT 10;

 * sqlite:///chinook.db
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, 0.99),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, 0.99),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, 0.99),
 (6, 'Put The Finger On You', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 205662, 6713451, 0.99),
 (7, "Let's Get It Up", 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 233926, 7636561, 0.99),
 (8, 'Inject The Venom', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 210834, 6852860, 0.99),
 (9, 'Snowballed', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 203102, 6599424, 0.99),
 (10, 'Evil Walks', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 263497, 8611245, 0.99)]

We want to join our table on the `MediaTypeId` column found in both tables. One more neat trick we can do in SQL - we can prefix the table name to indicate which columns we want to bring back in our view, like so:

In [65]:
%%sql
SELECT tracks.Name, tracks.Composer, tracks.Milliseconds, media_types.MediaTypeId
FROM tracks
JOIN media_types
ON tracks.MediaTypeId = media_types.MediaTypeId
LIMIT 15;

 * sqlite:///chinook.db
Done.

[('For Those About To Rock (We Salute You)', 'Angus Young, Malcolm Young, Brian Johnson', 343719, 1),
 ('Put The Finger On You', 'Angus Young, Malcolm Young, Brian Johnson', 205662, 1),
 ("Let's Get It Up", 'Angus Young, Malcolm Young, Brian Johnson', 233926, 1),
 ('Inject The Venom', 'Angus Young, Malcolm Young, Brian Johnson', 210834, 1),
 ('Snowballed', 'Angus Young, Malcolm Young, Brian Johnson', 203102, 1),
 ('Evil Walks', 'Angus Young, Malcolm Young, Brian Johnson', 263497, 1),
 ('C.O.D.', 'Angus Young, Malcolm Young, Brian Johnson', 199836, 1),
 ('Breaking The Rules', 'Angus Young, Malcolm Young, Brian Johnson', 263288, 1),
 ('Night Of The Long Knives', 'Angus Young, Malcolm Young, Brian Johnson', 205688, 1),
 ('Spellbound', 'Angus Young, Malcolm Young, Brian Johnson', 270863, 1),
 ('Go Down', 'AC/DC', 331180, 1),
 ('Dog Eat Dog', 'AC/DC', 215196, 1),
 ('Let There Be Rock', 'AC/DC', 366654, 1),
 ('Bad Boy Boogie', 'AC/DC', 267728, 1),
 ('Problem Child', 'AC/DC', 325041, 1)]

**ADVANCED SQL: `GROUP BY` and `JOIN`**

In [66]:
%%sql
SELECT T.Name, T.Composer, T.Milliseconds, M.MediaTypeId
FROM tracks as T
JOIN media_types as M
ON T.MediaTypeId = M.MediaTypeId
GROUP BY T.Composer
LIMIT 15;

 * sqlite:///chinook.db
Done.

[('Desafinado', None, 185338, 1),
 ('Iron Man', 'A. F. Iommi, W. Ward, T. Butler, J. Osbourne', 172120, 1),
 ('New Rhumba', 'A. Jamal', 276871, 1),
 ('Astronomy', 'A.Bouchard/J.Bouchard/S.Pearlman', 397531, 1),
 ('Hard To Handle', 'A.Isbell/A.Jones/O.Redding', 206994, 1),
 ('Go Down', 'AC/DC', 331180, 1),
 ('Fanfare for the Common Man', 'Aaron Copland', 198064, 2),
 ("OAM's Blues", 'Aaron Goldberg', 266936, 5),
 ('Shock Me', 'Ace Frehley', 227291, 1),
 ('Camarão que Dorme e Onda Leva', 'Acyi Marques/Arlindo Bruz/Braço, Beto Sem/Zeca Pagodinho', 299102, 1),
 ('Saudade Louca', 'Acyr Marques/Arlindo Cruz/Franco', 243591, 1),
 ('Tradição', 'Adalto Magalha/Lourenco', 269165, 1),
 ('Vertigo', 'Adam Clayton, Bono, Larry Mullen & The Edge', 194612, 1),
 ('Beautiful Day', 'Adam Clayton, Bono, Larry Mullen, The Edge', 248163, 1),
 ('Hey America', 'Addie William Jones/Nat Jones', 218226, 1)]

Other things we can see in SQL: 
- Views, 
- Stored Procedures
- Schemas

Two important summary points:

<img src="generic_query.png" width="300">

# Storing Results into Python

Use the `<<` syntax, in the `%%sql` magic command. All SQL queries will return a table or a series with an index, which can then be converted to a `Pandas` or `NumPy` object.

In [67]:
%%sql df_1 <<
SELECT CustomerId, BillingCountry, InvoiceDate, SUM(total), MAX(total), MIN(total)
FROM invoices
GROUP BY CustomerID
LIMIT 20;

 * sqlite:///chinook.db
Done.
Returning data to local variable df_1

In [68]:
type(df_1)

sql.run.ResultSet

In [69]:
df_1

[(1, 'Brazil', '2011-05-06 00:00:00', 39.62, 13.86, 0.99),
 (2, 'Germany', '2012-07-13 00:00:00', 37.620000000000005, 13.86, 0.99),
 (3, 'Canada', '2013-09-20 00:00:00', 39.62, 13.86, 0.99),
 (4, 'Norway', '2009-11-25 00:00:00', 39.62, 15.86, 0.99),
 (5, 'Czech Republic', '2011-02-02 00:00:00', 40.620000000000005, 16.86, 0.99),
 (6, 'Czech Republic', '2012-04-11 00:00:00', 49.620000000000005, 25.86, 0.99),
 (7, 'Austria', '2013-06-19 00:00:00', 42.62, 18.86, 0.99),
 (8, 'Belgium', '2009-08-24 00:00:00', 37.62, 13.86, 0.99),
 (9, 'Denmark', '2010-11-01 00:00:00', 37.620000000000005, 13.86, 0.99),
 (10, 'Brazil', '2012-01-09 00:00:00', 37.620000000000005, 13.86, 0.99),
 (11, 'Brazil', '2013-03-18 00:00:00', 37.620000000000005, 13.86, 0.99),
 (12, 'Brazil', '2009-05-23 00:00:00', 37.62, 13.86, 0.99),
 (13, 'Brazil', '2010-07-31 00:00:00', 37.620000000000005, 13.86, 0.99),
 (14, 'Canada', '2011-10-08 00:00:00', 37.620000000000005, 13.86, 0.99),
 (15, 'Canada', '2012-12-15 00:00:00', 38.620000000000005, 13.86, 0.99),
 (16, 'USA', '2009-02-19 00:00:00', 37.62, 13.86, 0.99),
 (17, 'USA', '2010-04-29 00:00:00', 39.620000000000005, 13.86, 0.99),
 (18, 'USA', '2011-07-07 00:00:00', 37.620000000000005, 13.86, 0.99),
 (19, 'USA', '2009-03-04 00:00:00', 38.620000000000005, 13.86, 1.98),
 (20, 'USA', '2013-11-21 00:00:00', 39.62, 13.86, 0.99)]

Let's try to use some `Pandas` commands on our dataframe!

In [70]:
# maybe let's first try to print out top 4 entries
df_1.head(4)

AttributeError: 'ResultSet' object has no attribute 'head'

Oops! We need to explicity create a Pandas dataframe object to use the Pandas functions!

In [71]:
import pandas as pd

# need to explicitly define that you want to make a pandas dataframe! Note that an index will be created 
# but you can specify other arguments in pd.DataFrame()
df_pandas = df_1.DataFrame()
df_pandas.head()

,CustomerId,BillingCountry,InvoiceDate,SUM(total),MAX(total),MIN(total)
0,1,Brazil,2011-05-06 00:00:00,39.62,13.86,0.99
1,2,Germany,2012-07-13 00:00:00,37.62,13.86,0.99
2,3,Canada,2013-09-20 00:00:00,39.62,13.86,0.99
3,4,Norway,2009-11-25 00:00:00,39.62,15.86,0.99
4,5,Czech Republic,2011-02-02 00:00:00,40.62,16.86,0.99

Looking good!

## Pandas knows SQL!

You can pass an entire SQL query using doc-string comment format ` """ """`. Alternatively, Pandas has a `pd.read_sql()` command that can be used!

In [73]:
query = """
SELECT CustomerId, BillingCountry, InvoiceDate, sum(total), max(total), min(total)
    FROM invoices
GROUP BY CustomerId
LIMIT 20;
"""

In [74]:
%%sql
$query

 * sqlite:///chinook.db
Done.

[(1, 'Brazil', '2011-05-06 00:00:00', 39.62, 13.86, 0.99),
 (2, 'Germany', '2012-07-13 00:00:00', 37.620000000000005, 13.86, 0.99),
 (3, 'Canada', '2013-09-20 00:00:00', 39.62, 13.86, 0.99),
 (4, 'Norway', '2009-11-25 00:00:00', 39.62, 15.86, 0.99),
 (5, 'Czech Republic', '2011-02-02 00:00:00', 40.620000000000005, 16.86, 0.99),
 (6, 'Czech Republic', '2012-04-11 00:00:00', 49.620000000000005, 25.86, 0.99),
 (7, 'Austria', '2013-06-19 00:00:00', 42.62, 18.86, 0.99),
 (8, 'Belgium', '2009-08-24 00:00:00', 37.62, 13.86, 0.99),
 (9, 'Denmark', '2010-11-01 00:00:00', 37.620000000000005, 13.86, 0.99),
 (10, 'Brazil', '2012-01-09 00:00:00', 37.620000000000005, 13.86, 0.99),
 (11, 'Brazil', '2013-03-18 00:00:00', 37.620000000000005, 13.86, 0.99),
 (12, 'Brazil', '2009-05-23 00:00:00', 37.62, 13.86, 0.99),
 (13, 'Brazil', '2010-07-31 00:00:00', 37.620000000000005, 13.86, 0.99),
 (14, 'Canada', '2011-10-08 00:00:00', 37.620000000000005, 13.86, 0.99),
 (15, 'Canada', '2012-12-15 00:00:00', 38.620000000000005, 13.86, 0.99),
 (16, 'USA', '2009-02-19 00:00:00', 37.62, 13.86, 0.99),
 (17, 'USA', '2010-04-29 00:00:00', 39.620000000000005, 13.86, 0.99),
 (18, 'USA', '2011-07-07 00:00:00', 37.620000000000005, 13.86, 0.99),
 (19, 'USA', '2009-03-04 00:00:00', 38.620000000000005, 13.86, 1.98),
 (20, 'USA', '2013-11-21 00:00:00', 39.62, 13.86, 0.99)]

In [75]:
#alternatively, we can use a tool like sqlalchemy to explicity define the connection
!pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (2.0.23)
Requirement already satisfied: greenlet!=0.4.17 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from SQLAlchemy) (3.0.1)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/ekaterinaossetchkina/opt/anaconda3/lib/python3.8/site-packages (from SQLAlchemy) (4.8.0)
WARNING: You are using pip version 21.1.2; however, version 23.3.1 is available.
You should consider upgrading via the '/Users/ekaterinaossetchkina/opt/anaconda3/bin/python -m pip install --upgrade pip' command.

In [ ]:
# note: sometimes an older version of Pandas can throw errors
!pip install --upgrade pandas

Here is an alternative way using `pd.read_sql()`. The advantage of this is that your output is already put into a pandas dataframe for you, which let's you combine SQL and Pandas functions!

In [77]:
# define your connection in sqlalchemy
engine = sqlalchemy.create_engine("sqlite:///chinook.db")
connection = engine.connect()

# write your query in a doc-string
query = """
SELECT CustomerId, BillingCountry, InvoiceDate, sum(total), max(total), min(total)
    FROM invoices
GROUP BY CustomerId
LIMIT 20;
"""

# pass both the query and the database connection into pd.read_sql
df = pd.read_sql(query, engine)
df.head()

,CustomerId,BillingCountry,InvoiceDate,sum(total),max(total),min(total)
0,1,Brazil,2011-05-06 00:00:00,39.62,13.86,0.99
1,2,Germany,2012-07-13 00:00:00,37.62,13.86,0.99
2,3,Canada,2013-09-20 00:00:00,39.62,13.86,0.99
3,4,Norway,2009-11-25 00:00:00,39.62,15.86,0.99
4,5,Czech Republic,2011-02-02 00:00:00,40.62,16.86,0.99

## Closing a SQL Connection

Connections are an expensive compute resource, and you might also risk losing your data if you unknowingly leave a connection open. As well, an open connection can cause serious performance issues in the cases that you have several users trying to access a database, and also be a potential for a data breach, through other users being able to access the original table code.

In [78]:
# save available connections to a dictionary
connection_dict = %sql --connections 
connection_dict

{'sqlite:///chinook.db': <sql.connection.Connection at 0x7fea214d0a00>}

In [79]:
# get the first connection string from the dictionary
connection_string = list(connection_dict.keys())[0] 

# get the connection object from the dictionary using the connection string
connection_object = connection_dict[connection_string]

# print connection
print(connection_object)

<sql.connection.Connection object at 0x7fea214d0a00>

In [80]:
# close the connection using the connection object's url attribute
%sql --close $connection_object.url

Let's check!

In [81]:
# check by rerunning the same dictionary from step 1
connection_dict = %sql --connections 
connection_dict

{}

# Let's Create Our Own Database!

Let's revisit the example from Week 3 Lecture 2 - web-scrabing Goodreads and The Guardian best book lists. Imagine you wanted to scrape this data, and then save this into a database, rather than individual csv files.

In [82]:
# Import 3rd party libraries
import os
import json 
import requests
import numpy as np
import pandas as pd
import seaborn as sns
from bs4 import BeautifulSoup
import matplotlib.pyplot as plt
import xml.etree.ElementTree as ET

url = "https://www.goodreads.com/list/show/2681.Time_Magazine_s_All_Time_100_Novels"

response = requests.get(url)
print(response.text[0:200])

<!DOCTYPE html>
<html class="desktop withSiteHeaderTopFullImage
">
<head>
  <title>Time Magazine's All-Time 100 Novels (100 books)</title>

<meta content='100 books based on 295 votes: To Kill a Mocki

In [83]:
# define our class that stores the html object
soup = BeautifulSoup(response.text, "html.parser")
books = soup

# retreive the book and authors
titles = books.find_all('a', 'bookTitle')
authors = books.find_all('a', 'authorName')

# define lists to store cleaned information
book_titles = [book.text.strip('\n') for book in titles]
author_names = [author.text for author in authors]
rating = [(i+1) for i in range(len(book_titles))]

# create dataframe with the lists
goodreads_df = pd.DataFrame({
    'titles': book_titles,
    'authors': author_names,
    'rank': rating
})    

goodreads_df.head()

                   titles              authors  rank
0   To Kill a Mockingbird           Harper Lee     1
1                    1984        George Orwell     2
2   The Lord of the Rings       J.R.R. Tolkien     3
3  The Catcher in the Rye        J.D. Salinger     4
4        The Great Gatsby  F. Scott Fitzgerald     5

In [84]:
goodreads_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   titles   100 non-null    object
 1   authors  100 non-null    object
 2   rank     100 non-null    int64
dtypes: int64(1), object(2)
memory usage: 2.5+ KB

First, let's create our database object! When we connect to a new database object, it will automatically create this empty file for us.

In [85]:
%%sql
sqlite:///movies.db

In [86]:
connection_dict = %sql --connections
connection_dict

{'sqlite:///movies.db': <sql.connection.Connection at 0x7fea233fff10>}

In [87]:
# get the first connection string from the dictionary
connection_string = list(connection_dict.keys())[0] 

# get the connection object from the dictionary using the connection string
connection_object = connection_dict[connection_string]

# print connection
print(connection_object)

<sql.connection.Connection object at 0x7fea233fff10>

In [88]:
# create a table in sql database from pandas df
goodreads_df.to_sql(name = 'goodreads', con = list(connection_dict.keys())[0])

100

Let's check that this table exists in our database!

In [89]:
%%sql
SELECT *
FROM goodreads
LIMIT 20;

 * sqlite:///movies.db
Done.

[(0, 'To Kill a Mockingbird', 'Harper Lee', 1),
 (1, '1984', 'George Orwell', 2),
 (2, 'The Lord of the Rings', 'J.R.R. Tolkien', 3),
 (3, 'The Catcher in the Rye', 'J.D. Salinger', 4),
 (4, 'The Great Gatsby', 'F. Scott Fitzgerald', 5),
 (5, 'The Lion, the Witch and the Wardrobe (Chronicles of Narnia, #1)', 'C.S. Lewis', 6),
 (6, 'Lord of the Flies', 'William Golding', 7),
 (7, 'Animal Farm', 'George Orwell', 8),
 (8, 'Catch-22', 'Joseph Heller', 9),
 (9, 'The Grapes of Wrath', 'John Steinbeck', 10),
 (10, 'Gone with the Wind', 'Margaret Mitchell', 11),
 (11, 'Slaughterhouse-Five', 'Kurt Vonnegut Jr.', 12),
 (12, "One Flew Over the Cuckoo's Nest", 'Ken Kesey', 13),
 (13, 'A Clockwork Orange', 'Anthony Burgess', 14),
 (14, 'Lolita', 'Vladimir Nabokov', 15),
 (15, "Are You There God? It's Me, Margaret", 'Judy Blume', 16),
 (16, 'Watchmen', 'Alan Moore', 17),
 (17, 'Atonement', 'Ian McEwan', 18),
 (18, 'Things Fall Apart (The African Trilogy, #1)', 'Chinua Achebe', 19),
 (19, 'Never Let Me Go', 'Kazuo Ishiguro', 20)]

Let's create a second table to write into, our database, this time using the top 100 books according to the Guardian.

In [90]:
# get url
url = "https://www.theguardian.com/world/2002/may/08/books.booksnews"

# preview results
response = requests.get(url)
print(response.text[0:200])

<!doctype html>
        <html lang="en">
            <head>
			    <!-- Hello there, HTML enthusiast! -->
                <title>The top 100 books of all time | Best books | The Guardian</title>

In [92]:
# define our class that stores the html object
soup = BeautifulSoup(response.text, "html.parser")
books = soup

# retreive the book and authors
titles = books.find_all('p', 'dcr-19m3vvb')

# print(titles[1].text)

# define lists to store cleaned information
book_titles = [book.text.split('by')[0].strip() for book in titles[:99]]
author_names = [book.text.split('by')[-1].split(',')[0].strip() for book in titles[:99]]
years = [book.text.split('(')[-1].split(')')[0].strip() for book in titles[:99]]
rating = [(i+1) for i in range(len(book_titles))]

# create dataframe with the lists
guardian_df = pd.DataFrame({
    'titles': book_titles,
    'authors': author_names,
    'years': years,
    'rank': rating
})    

guardian_df.head()

                               titles           authors      years  rank
0                                1984     George Orwell  1903-1950     1
1                      A Doll's House      Henrik Ibsen  1828-1906     2
2             A Sentimental Education  Gustave Flaubert  1821-1880     3
3                   Absalom, Absalom!  William Faulkner  1897-1962     4
4  The Adventures of Huckleberry Finn        Mark Twain  1835-1910     5

In [93]:
guardian_df.to_sql(name = 'guardian', con = list(connection_dict.keys())[0])

99

Let's preview the `guardian` table:

In [94]:
%%sql
SELECT *
FROM guardian
LIMIT 10;

 * sqlite:///movies.db
Done.

[(0, '1984', 'George Orwell', '1903-1950', 1),
 (1, "A Doll's House", 'Henrik Ibsen', '1828-1906', 2),
 (2, 'A Sentimental Education', 'Gustave Flaubert', '1821-1880', 3),
 (3, 'Absalom, Absalom!', 'William Faulkner', '1897-1962', 4),
 (4, 'The Adventures of Huckleberry Finn', 'Mark Twain', '1835-1910', 5),
 (5, 'The Aeneid', 'Virgil', '70-19 BC', 6),
 (6, 'Anna Karenina', 'Leo Tolstoy', '1828-1910', 7),
 (7, 'Beloved', 'Toni Morrison', 'b. 1931', 8),
 (8, 'Berlin Alexanderplatz', 'Alfred Doblin', '1878-1957', 9),
 (9, 'Blindness', 'Jose Saramago', '1922-2010', 10)]

Now let's join our two tables! Let's see what books are in common between the Guardian and Goodreads:

In [96]:
%%sql
SELECT guard.titles as "Book", guard.rank AS "Guardian Rank", gr.rank AS "GoodReads Rank"
FROM guardian AS guard
JOIN goodreads as gr
ON guard.titles = gr.titles
LIMIT 15;

 * sqlite:///movies.db
Done.

[('1984', 1, 2),
 ('Beloved', 8, 23),
 ('The Golden Notebook', 36, 70),
 ('Invisible Man', 46, 21),
 ('Lolita', 52, 15),
 ("Midnight's Children", 63, 48),
 ('Mrs. Dalloway', 65, 22),
 ('The Sound and the Fury', 87, 31),
 ('To the Lighthouse', 94, 37)]

In [97]:
%%sql
SELECT COUNT(*)
FROM guardian AS guard
JOIN goodreads as gr
ON guard.titles = gr.titles
LIMIT 15;

 * sqlite:///movies.db
Done.

[(9,)]

Interesting - only 9 of the titles are shared between the two sources. Let's create a new table from this join!

In [98]:
%%sql
CREATE TABLE highest_ranking AS
SELECT guard.titles as "Book", guard.rank AS "Guardian Rank", gr.rank AS "GoodReads Rank"
FROM guardian AS guard
JOIN goodreads as gr
ON guard.titles = gr.titles
LIMIT 15;

 * sqlite:///movies.db
Done.

[]

Let's try to preview our table:

In [99]:
%%sql
SELECT *
FROM highest_ranking;

 * sqlite:///movies.db
Done.

[('1984', 1, 2),
 ('Beloved', 8, 23),
 ('The Golden Notebook', 36, 70),
 ('Invisible Man', 46, 21),
 ('Lolita', 52, 15),
 ("Midnight's Children", 63, 48),
 ('Mrs. Dalloway', 65, 22),
 ('The Sound and the Fury', 87, 31),
 ('To the Lighthouse', 94, 37)]

Let's make one more simple table for genres. This time, we will create a table by defining column names, then using the `INSERT` keyword to add tuples:

In [100]:
%%sql
CREATE TABLE genres(id integer, genre varchar(200));

INSERT into genres(id, genre) values(1, "Horror");
INSERT into genres(id, genre) values(2, "Classical");
INSERT into genres(id, genre) values(3, "Romance");
INSERT into genres(id, genre) values(4, "History");
INSERT into genres(id, genre) values(5, "Fiction");
INSERT into genres(id, genre) values(6, "Adventure");

SELECT * FROM genres;

 * sqlite:///movies.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Horror'),
 (2, 'Classical'),
 (3, 'Romance'),
 (4, 'History'),
 (5, 'Fiction'),
 (6, 'Adventure')]

Let's check all the tables that are in our database:

In [101]:
%%sql
SELECT * 
FROM sqlite_master 
WHERE type='table';

 * sqlite:///movies.db
Done.

[('table', 'goodreads', 'goodreads', 2, 'CREATE TABLE goodreads (\n\t"index" BIGINT, \n\ttitles TEXT, \n\tauthors TEXT, \n\trank BIGINT\n)'),
 ('table', 'guardian', 'guardian', 6, 'CREATE TABLE guardian (\n\t"index" BIGINT, \n\ttitles TEXT, \n\tauthors TEXT, \n\tyears TEXT, \n\trank BIGINT\n)'),
 ('table', 'highest_ranking', 'highest_ranking', 10, 'CREATE TABLE highest_ranking(\n  Book TEXT,\n  "Guardian Rank" INT,\n  "GoodReads Rank" INT\n)'),
 ('table', 'genres', 'genres', 11, 'CREATE TABLE genres(id integer, genre varchar(200))')]

And finally, close the connection, same as before.

In [102]:
# close the connection using the connection object's url attribute
%sql --close $connection_object.url

The End!